src/Documents/фуПриемНаРаботу/фуПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>фуПриемНаРаботу</name>
  <registerRecords>InformationRegister.фуКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>ВалютаВыплатыЗарплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.фуГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.фуДепартамент</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.фуДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МотивационнаяСхема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТрудовогоДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладОфициальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.фуОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСпособВыплаты</name>
    <type>
      <types>CatalogRef.фуСпособыВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.фуОтделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.фуСтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_Транзакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерРаботы</name>
    <type>
      <types>CatalogRef.фуХарактерРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СканыДокументовКадры</name>
    <attributes>
      <name>СканДокумента</name>
      <type>
        <types>CatalogRef.фуСканыДокументовКадры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/фуКадроваяИсторияСотрудников/фуКадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>фуКадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.фуВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.фуОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.фуДепартамент</types>
    </type>
  </resources>
  <resources>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.фуОтделы</types>
    </type>
  </resources>
  <resources>
    <name>Группа</name>
    <type>
      <types>CatalogRef.фуГруппы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.фуДолжности</types>
    </type>
  </resources>
  <resources>
    <name>ОкладОфициальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкладУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотивационнаяСхема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВыплатыЗарплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ХарактерРаботы</name>
    <type>
      <types>CatalogRef.фуХарактерРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/фуСтатусыДокументов/фуСтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>фуСтатусыДокументов</name>
  <enumValues>
    <name>КСогласованию</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
</mdclass:Enum>

src/Enums/фуВидыКадровыхСобытий/фуВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>фуВидыКадровыхСобытий</name>
  <enumValues>
    <name>ПриемНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>КадровоеИзменение</name>
  </enumValues>
</mdclass:Enum>

src/Documents/фуПриемНаРаботу/ObjectModule.bsl
#Область о // Стандартные процедуры и функции:

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаПриемаНаРаботу) Тогда
		ЭтотОбъект.ДатаПриемаНаРаботу = ЭтотОбъект.Дата;
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаПриказа) Тогда
		ЭтотОбъект.ДатаПриказа = ЭтотОбъект.ДатаПриемаНаРаботу;
	КонецЕсли; 
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	фуКадровыйУчетСервер.УдалениеСкановДокументаПередЗаписью(ЭтотОбъект);
	// --- Чесноков М.С. 2021-09-22 F1-121
	
	// +++ Чесноков М.С. 2021-10-26 F1-133
	Если Не ЗначениеЗаполнено(ЭтотОбъект.СтатусДокумента) Тогда
		Если НачалоГода(ЭтотОбъект.Дата) >= Дата("20210101000000") Тогда
			ЭтотОбъект.СтатусДокумента = Перечисления.фуСтатусыДокументов.КСогласованию;	
		КонецЕсли; 
	КонецЕсли; 
	// --- Чесноков М.С. 2021-10-26 F1-133 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Сотрудник = Справочники.фуСотрудники.ПустаяСсылка();
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	ЭтотОбъект.СканыДокументовКадры.Очистить();
	// --- Чесноков М.С. 2021-09-22 F1-121
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			ЭтотОбъект.Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_фуКадроваяИсторияСотрудников(Отказ,Режим);
    
	// +++ Чесноков М.С. 2021-11-10 F1-137
	// +++ Чесноков М.С. 2021-10-25 F1-133
	//фмКадровыйУчетСервер.ОтправитьОповещениеОДобавленииНовогоСотрудникаНаЭлектроннуюПочтуОтветсвеннымЛицам(ЭтотОбъект.Ссылка);
	// --- Чесноков М.С. 2021-10-25 F1-133 
	ТекстФоновойПроцедуры = "
	|//Тут передаем текст фоновой процедуры, это может быть вызов каких то процедур или полноценный код
	|//вызов процедур проще, т.к. тупо легче отлаживать, т.к. код в этой процедуре обычной отладке не поддастся,
	|//а при вызове процедуры или функции мы ставим там точку останова и включаем в отладке автоматическое
	|//подключение  фоновых заданий. Запускать можно любые методы для выполнения на сервере.
	|
	|фмКадровыйУчетСервер.ОтправитьОповещениеОДобавленииНовогоСотрудникаНаЭлектроннуюПочтуОтветсвеннымЛицам(ОбъектСсылка);";
	
	фуОбщийСервер.ЗапуститьФоновоеВыполнение(ТекстФоновойПроцедуры,Новый Структура("ОбъектСсылка",ЭтотОбъект.Ссылка));
	// --- Чесноков М.С. 2021-11-10 F1-137  
	 
КонецПроцедуры

#КонецОбласти

#Область о // Запись движений:

Процедура ЗаписьДвижений_фуКадроваяИсторияСотрудников(Отказ,Режим)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Сотрудник) Тогда
		Отказ = Истина;
		фуОбщийКлиентСервер.СообщитьПользователю("Внимание! Сотрудник не добавлен в справочник. Проведение отменено.");
		Возврат;
    КонецЕсли;
    
	Движение = Движения.фуКадроваяИсторияСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ЭтотОбъект);
	Движение.Период = ЭтотОбъект.ДатаПриемаНаРаботу;
	Движение.ВидСобытия = Перечисления.фуВидыКадровыхСобытий.ПриемНаРаботу;
    
    Движения.фуКадроваяИсторияСотрудников.Записать(Истина);

КонецПроцедуры

#КонецОбласти
